# Введение в Data Science и машинное обучение

Анатолий Карпов / Bioinformatics Institute

https://stepik.org/course/4852/

## 1. Введение

### 1.4. Pandas, Dataframes, нет, панды тут ни при чем

[Pandas](https://pandas.pydata.org/pandas-docs/stable/) и [Numpy](http://www.numpy.org/)

*Онлайн с возможностью запуска на gpu https://colab.research.google.com*

[Данные](https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv), которые мы будем использовать в этом и следующих уроках

In [1]:
import pandas as pd
import numpy as np

In [2]:
students_performance = pd.read_csv('data\\StudentsPerformance.csv')

In [3]:
students_performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [4]:
students_performance.tail(1)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,female,group D,some college,free/reduced,none,77,86,86

In [5]:
students_performance.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [6]:
students_performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [7]:
students_performance.shape

(1000, 8)

In [8]:
students_performance.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [9]:
students_performance.iloc[[0, 3, 10], [0, 5, -1]]

    gender  math score  writing score
0   female          72             74
3     male          47             44
10    male          58             52

In [10]:
students_performance_with_names = students_performance.iloc[[0, 3, 4, 7, 8]]

In [11]:
students_performance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67

In [12]:
students_performance_with_names.index = ['Cersei', 'Tywin', 'Gregor', 'Joffre', 'Ilyn Payne']

In [13]:
students_performance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Tywin,male,group A,associate's degree,free/reduced,none,47,57,44
Gregor,male,group C,some college,standard,none,76,78,75
Joffre,male,group B,some college,free/reduced,none,40,43,39
Ilyn Payne,male,group D,high school,free/reduced,completed,64,64,67

In [14]:
students_performance_with_names.loc[['Cersei', 'Joffre']]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Joffre,male,group B,some college,free/reduced,none,40,43,39

In [15]:
students_performance_with_names.loc[['Cersei', 'Joffre'], ['gender', 'writing score']]

        gender  writing score
Cersei  female             74
Joffre    male             39

In [16]:
students_performance_with_names.iloc[:, 0]

Cersei        female
Tywin           male
Gregor          male
Joffre          male
Ilyn Payne      male
Name: gender, dtype: object

In [17]:
type(students_performance_with_names.iloc[:, 0])

pandas.core.series.Series

In [18]:
type(students_performance_with_names.loc[['Cersei', 'Joffre'], ['gender', 'writing score']])

pandas.core.frame.DataFrame

In [19]:
my_series_1 = pd.Series([1, 2, 3], index = ['Cersei', 'Tywin', 'Gregor'])
my_series_2 = pd.Series([4, 5, 6], index = ['Cersei', 'Tywin', 'Gregor'])

In [20]:
pd.DataFrame({'col_name_1': my_series_1, 'col_name_2': my_series_2})

        col_name_1  col_name_2
Cersei           1           4
Tywin            2           5
Gregor           3           6

In [21]:
# выдаст серию, хранящуюся в колонке 'gender'
students_performance_with_names['gender']

Cersei        female
Tywin           male
Gregor          male
Joffre          male
Ilyn Payne      male
Name: gender, dtype: object

In [22]:
type(students_performance_with_names['gender'])

pandas.core.series.Series

In [23]:
students_performance_with_names['gender'].shape

(5,)

In [24]:
# выдаст датафрейм, состоящий из колонки 'gender'
students_performance_with_names[['gender']]

            gender
Cersei      female
Tywin         male
Gregor        male
Joffre        male
Ilyn Payne    male

In [25]:
type(students_performance_with_names[['gender']])

pandas.core.frame.DataFrame

In [26]:
students_performance_with_names[['gender']].shape

(5, 1)

In [27]:
students_performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [28]:
# df.get_dtype_counts() уже не рекомендуется, взамен есть df.dtypes.value_counts()
students_performance.dtypes.value_counts()

object    5
int64     3
dtype: int64

In [29]:
students_performance.index

RangeIndex(start=0, stop=1000, step=1)

In [30]:
students_performance_with_names.index

Index(['Cersei', 'Tywin', 'Gregor', 'Joffre', 'Ilyn Payne'], dtype='object')

In [31]:
students_performance.size

8000

In [32]:
students_performance.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

**Контрольные вопросы:**

А теперь используем эти методы на знаменитом титаническом датасэте! Загрузите датасэт, посмотрите на датафрэйм и ответьте на вопросы

Число колонок в представленном датафрэйме _, а число строк _. Тип float имеют _ колонки, int - _, и object _

In [33]:
titanic = pd.read_csv('data\\titanic.csv')

In [34]:
titanic.shape

(891, 12)

In [35]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [36]:
titanic.dtypes.value_counts()

object     5
int64      5
float64    2
dtype: int64